logs/gpuburn50_2/fio__2025-08-14_18-57-41.log
disk_load_20percent: (g=0): rw=randrw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=16
...
fio-3.19
Starting 8 processes

disk_load_20percent: (groupid=0, jobs=8): err= 0: pid=634418: Thu Aug 14 19:11:02 2025
  read: IOPS=240, BW=30.0MiB/s (31.5MB/s)(23.4GiB/800008msec)
    slat (usec): min=4, max=146, avg=12.15, stdev= 5.12
    clat (usec): min=34, max=193674, avg=6763.76, stdev=4489.24
     lat (usec): min=45, max=193685, avg=6776.03, stdev=4488.86
    clat percentiles (usec):
     |  1.00th=[   202],  5.00th=[  1811], 10.00th=[  2474], 20.00th=[  3621],
     | 30.00th=[  4621], 40.00th=[  5473], 50.00th=[  6259], 60.00th=[  6980],
     | 70.00th=[  8094], 80.00th=[  9503], 90.00th=[ 11469], 95.00th=[ 13304],
     | 99.00th=[ 17695], 99.50th=[ 19792], 99.90th=[ 30278], 99.95th=[ 35914],
     | 99.99th=[177210]
   bw (  KiB/s): min=23552, max=38144, per=100.00%, avg=30752.83, stdev=97.17, samples=12784
   iops        : min=  184, max=  298, avg=240.25, stdev= 0.76, samples=12784
  write: IOPS=240, BW=30.0MiB/s (31.5MB/s)(23.4GiB/800008msec); 0 zone resets
    slat (usec): min=5, max=179, avg=13.46, stdev= 5.08
    clat (usec): min=212, max=193661, avg=710.94, stdev=2919.79
     lat (usec): min=220, max=193675, avg=724.60, stdev=2919.79
    clat percentiles (usec):
     |  1.00th=[   231],  5.00th=[   243], 10.00th=[   249], 20.00th=[   258],
     | 30.00th=[   265], 40.00th=[   277], 50.00th=[   318], 60.00th=[   367],
     | 70.00th=[   523], 80.00th=[   693], 90.00th=[  1090], 95.00th=[  2343],
     | 99.00th=[  6521], 99.50th=[  7701], 99.90th=[ 13566], 99.95th=[ 22152],
     | 99.99th=[177210]
   bw (  KiB/s): min=22528, max=39168, per=100.00%, avg=30752.80, stdev=104.33, samples=12784
   iops        : min=  176, max=  306, avg=240.25, stdev= 0.82, samples=12784
  lat (usec)   : 50=0.08%, 100=0.21%, 250=6.13%, 500=28.82%, 750=6.40%
  lat (usec)   : 1000=3.23%
  lat (msec)   : 2=5.66%, 4=10.01%, 10=30.99%, 20=8.21%, 50=0.24%
  lat (msec)   : 100=0.01%, 250=0.02%
  cpu          : usr=0.06%, sys=0.08%, ctx=973720, majf=0, minf=367
  IO depths    : 1=100.0%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=192003,192005,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=30.0MiB/s (31.5MB/s), 30.0MiB/s-30.0MiB/s (31.5MB/s-31.5MB/s), io=23.4GiB (25.2GB), run=800008-800008msec
  WRITE: bw=30.0MiB/s (31.5MB/s), 30.0MiB/s-30.0MiB/s (31.5MB/s-31.5MB/s), io=23.4GiB (25.2GB), run=800008-800008msec

Disk stats (read/write):
  sda: ios=192000/192214, merge=1/86, ticks=1299237/129743, in_queue=1428979, util=32.31%